validation/polydisperseBubbleFoam/Delft/DelftPolydisperse/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        solver          GAMG;
        smoother        DIC;
        nAlphaCorr      1;
        nAlphaSubCycles 2;
    }
    p_rgh
    {
        solver          PCG;
        smoother        DIC;
        preconditioner  DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 40;
        agglomerator    faceAreaPair;
        mergeLevels     2;
        tolerance       1e-10;
        maxIter         1000;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "U.air.*"
    {
        solver          PBiCG;
        preconditioner  DILU;
        smoother        DIC;
        tolerance       1e-10;
        relTol          0;
    }

    U.water
    {
        solver          smoothSolver;
        preconditioner  symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }

    "Up.*"
    {
        solver          diagonal;
        tolerance       1e-12;
        relTol          0;
        minIter         1;
    }

    "moment.*"
    {
        solver          diagonal;
        tolerance       1e-12;
        relTol          0;
        minIter         1;
    }

    "e.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0;
        minIter         1;
    }

    "(k|epsilon|Theta).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }
}

PIMPLE
{
    nOuterCorrectors 5;
    nCorrectors      2;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 1e5;
    residualControl
    {
        p_rgh
        {
            tolerance 1e-6;
            relTol    0;
        }
    }
}

relaxationFactors
{
    equations
    {
        p_rgh        0.3;
    }
}


// ************************************************************************* //
